# Feature Engineering
Example - [Day 20 & 21
](https://www.figma.com/board/B7MCmk03NI8BLogat8iuAz/AI-ML-Salman-Batch?node-id=0-1&p=f&t=ndhpwbunbqYJYVqA-0)

- its transforming raw data into  features that make  machine learning work better
    -  to improve 
    -

- correlation
    - correlation matrix
    - heatmaps
    - pairplot
- understand which features are the most strongly related to the output

 **categorical**
- will include Binary Features (0 or 1)
- sex - M F 
- Survived - Yes or No
- category data type
- ordinal data type - you can set up a scale in the categories - small , medium, large - cold , warm

**Numerical Features**
- where the are numbers
- will include float and integers
- continues value
- grouping up will not much make much sense (unless doing clustering)

In [1]:
import pandas as pd
import numpy as np
import seaborn as sns

In [3]:
iris = sns.load_dataset('iris')
iris.head()

   sepal_length  sepal_width  petal_length  petal_width species
0           5.1          3.5           1.4          0.2  setosa
1           4.9          3.0           1.4          0.2  setosa
2           4.7          3.2           1.3          0.2  setosa
3           4.6          3.1           1.5          0.2  setosa
4           5.0          3.6           1.4          0.2  setosa

In [4]:
iris.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 150 entries, 0 to 149
Data columns (total 5 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   sepal_length  150 non-null    float64
 1   sepal_width   150 non-null    float64
 2   petal_length  150 non-null    float64
 3   petal_width   150 non-null    float64
 4   species       150 non-null    object
dtypes: float64(4), object(1)
memory usage: 6.0+ KB

In [6]:
titanic = sns.load_dataset('titanic')
titanic.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 15 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   survived     891 non-null    int64
 1   pclass       891 non-null    int64
 2   sex          891 non-null    object
 3   age          714 non-null    float64
 4   sibsp        891 non-null    int64
 5   parch        891 non-null    int64
 6   fare         891 non-null    float64
 7   embarked     889 non-null    object
 8   class        891 non-null    category
 9   who          891 non-null    object
 10  adult_male   891 non-null    bool
 11  deck         203 non-null    category
 12  embark_town  889 non-null    object
 13  alive        891 non-null    object
 14  alone        891 non-null    bool
dtypes: bool(2), category(2), float64(2), int64(4), object(5)
memory usage: 80.7+ KB

- Categorical = 9
- numerical = 6

In [7]:
penguins = sns.load_dataset('penguins')

In [8]:
penguins.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 344 entries, 0 to 343
Data columns (total 7 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   species            344 non-null    object
 1   island             344 non-null    object
 2   bill_length_mm     342 non-null    float64
 3   bill_depth_mm      342 non-null    float64
 4   flipper_length_mm  342 non-null    float64
 5   body_mass_g        342 non-null    float64
 6   sex                333 non-null    object
dtypes: float64(4), object(3)
memory usage: 18.9+ KB

- Categorical = 3
- numerical = 4

--------

# Encoding

In [12]:
# Example
s = pd.Series(['cat', 'cow', 'dog'])
print("Series:\n", s)
print("Mapping: ")
s.map({'cat': 'kitten', 'cow': 'calf'})

Series:
 0    cat
1    cow
2    dog
dtype: object
Mapping:

0    kitten
1      calf
2       NaN
dtype: object

In [13]:
# Label encoding
# column that you can encode

penguins['species'].unique()
# {  }

species_codes = {
    'Adelie': 0,
    'Chinstrap': 1,
    'Gentoo':2
}

# Map function
penguins['species_encoded'] = penguins['species'].map(species_codes)    
penguins.sample(10)

,species,island,bill_length_mm,bill_depth_mm,flipper_length_mm,body_mass_g,sex,species_encoded
56,Adelie,Biscoe,39.0,17.5,186.0,3550.0,Female,0
274,Gentoo,Biscoe,46.5,14.4,217.0,4900.0,Female,2
273,Gentoo,Biscoe,50.1,15.0,225.0,5000.0,Male,2
10,Adelie,Torgersen,37.8,17.1,186.0,3300.0,NaN,0
40,Adelie,Dream,36.5,18.0,182.0,3150.0,Female,0
179,Chinstrap,Dream,49.5,19.0,200.0,3800.0,Male,1
155,Chinstrap,Dream,45.4,18.7,188.0,3525.0,Female,1
91,Adelie,Dream,41.1,18.1,205.0,4300.0,Male,0
343,Gentoo,Biscoe,49.9,16.1,213.0,5400.0,Male,2
92,Adelie,Dream,34.0,17.1,185.0,3400.0,Female,0

In [15]:
penguins['island'].unique()

array(['Torgersen', 'Biscoe', 'Dream'], dtype=object)

In [16]:
island_codes = {
    'Torgersen' : 0,
    'Biscoe' : 1,
    'Dream': 2
}

penguins['island_encoded'] = penguins['island'].map(island_codes)
penguins.sample(10)

,species,island,bill_length_mm,bill_depth_mm,flipper_length_mm,body_mass_g,sex,species_encoded,island_encoded
8,Adelie,Torgersen,34.1,18.1,193.0,3475.0,NaN,0,0
32,Adelie,Dream,39.5,17.8,188.0,3300.0,Female,0,2
65,Adelie,Biscoe,41.6,18.0,192.0,3950.0,Male,0,1
171,Chinstrap,Dream,49.2,18.2,195.0,4400.0,Male,1,2
108,Adelie,Biscoe,38.1,17.0,181.0,3175.0,Female,0,1
172,Chinstrap,Dream,42.4,17.3,181.0,3600.0,Female,1,2
307,Gentoo,Biscoe,51.3,14.2,218.0,5300.0,Male,2,1
231,Gentoo,Biscoe,49.0,16.1,216.0,5550.0,Male,2,1
322,Gentoo,Biscoe,47.2,15.5,215.0,4975.0,Female,2,1
145,Adelie,Dream,39.0,18.7,185.0,3650.0,Male,0,2

In [18]:
penguins.isnull().sum()

species               0
island                0
bill_length_mm        2
bill_depth_mm         2
flipper_length_mm     2
body_mass_g           2
sex                  11
species_encoded       0
island_encoded        0
dtype: int64

In [22]:
pd.factorize(penguins['species'])

(array([0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
        0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
        0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
        0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
        0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
        0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
        0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 1,
        1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1,
        1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1,
        1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1,
        2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2,
        2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2,
        2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2,
        2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2,
        2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2,
        2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2]),
 Index(['Adelie', 'Chinstrap', 'Gentoo'], dtype='object'))

In [ ]:
# factorize
# species still contains the species names
#factorize will take the column and assign numbers to the new groups
pd.factorize(penguins['species'])
penguins['species_factorized']

SyntaxError: cannot assign to function call here. Maybe you meant '==' instead of '='? (2804732017.py, line 5)

In [23]:
x,y = pd.factorize(penguins['species'])

In [24]:
penguins['species_factorized'] = x

In [ ]:
# .cat 

df50 = penguins.copy() 
penguins['species'].cat

In [ ]:
df50 = penguins.copy() 
df60['species'] = df50['species'].astype('category')
df50.info()

df50['species_cat_encoded']=df50['species'].cat.codes
df50

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 344 entries, 0 to 343
Data columns (total 12 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   species             344 non-null    category
 1   island              344 non-null    category
 2   bill_length_mm      342 non-null    float64
 3   bill_depth_mm       342 non-null    float64
 4   flipper_length_mm   342 non-null    float64
 5   body_mass_g         342 non-null    float64
 6   sex                 333 non-null    object
 7   species_encoded     344 non-null    int64
 8   island_encoded      344 non-null    int64
 9   species_factorized  344 non-null    int64
 10  island_factorized   344 non-null    int64
 11  island_cat_encoded  344 non-null    int8
dtypes: category(2), float64(4), int64(4), int8(1), object(1)
memory usage: 25.6+ KB

,species,island,bill_length_mm,bill_depth_mm,flipper_length_mm,body_mass_g,sex,species_encoded,island_encoded,species_factorized,island_factorized,island_cat_encoded,species_cat_encoded
0,Adelie,Torgersen,39.1,18.7,181.0,3750.0,Male,0,0,0,0,2,0
1,Adelie,Torgersen,39.5,17.4,186.0,3800.0,Female,0,0,0,0,2,0
2,Adelie,Torgersen,40.3,18.0,195.0,3250.0,Female,0,0,0,0,2,0
3,Adelie,Torgersen,NaN,NaN,NaN,NaN,NaN,0,0,0,0,2,0
4,Adelie,Torgersen,36.7,19.3,193.0,3450.0,Female,0,0,0,0,2,0
...,...,...,...,...,...,...,...,...,...,...,...,...,...
339,Gentoo,Biscoe,NaN,NaN,NaN,NaN,NaN,2,1,2,1,0,2
340,Gentoo,Biscoe,46.8,14.3,215.0,4850.0,Female,2,1,2,1,0,2
341,Gentoo,Biscoe,50.4,15.7,222.0,5750.0,Male,2,1,2,1,0,2
342,Gentoo,Biscoe,45.2,14.8,212.0,5200.0,Female,2,1,2,1,0,2
343,Gentoo,Biscoe,49.9,16.1,213.0,5400.0,Male,2,1,2,1,0,2

- manual
- factorized
- categorized

In [34]:
x,y = pd.factorize(penguins['island'])

In [42]:
df50['island_factorized'] = x
df50

,species,island,bill_length_mm,bill_depth_mm,flipper_length_mm,body_mass_g,sex,species_encoded,island_encoded,species_factorized,species_cat_encoded,island_cat_encoded,island_factorized
0,Adelie,Torgersen,39.1,18.7,181.0,3750.0,Male,0,0,0,0,2,0
1,Adelie,Torgersen,39.5,17.4,186.0,3800.0,Female,0,0,0,0,2,0
2,Adelie,Torgersen,40.3,18.0,195.0,3250.0,Female,0,0,0,0,2,0
3,Adelie,Torgersen,NaN,NaN,NaN,NaN,NaN,0,0,0,0,2,0
4,Adelie,Torgersen,36.7,19.3,193.0,3450.0,Female,0,0,0,0,2,0
...,...,...,...,...,...,...,...,...,...,...,...,...,...
339,Gentoo,Biscoe,NaN,NaN,NaN,NaN,NaN,2,1,2,2,0,1
340,Gentoo,Biscoe,46.8,14.3,215.0,4850.0,Female,2,1,2,2,0,1
341,Gentoo,Biscoe,50.4,15.7,222.0,5750.0,Male,2,1,2,2,0,1
342,Gentoo,Biscoe,45.2,14.8,212.0,5200.0,Female,2,1,2,2,0,1
343,Gentoo,Biscoe,49.9,16.1,213.0,5400.0,Male,2,1,2,2,0,1

In [60]:
df60 =df50.drop(['species_cat_encoded','island_cat_encoded'] , axis=1)

In [61]:
df60['species'] = df60['species'].astype('category')
df60.info()

df60['species_cat_encoded']=df60['species'].cat.codes

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 344 entries, 0 to 343
Data columns (total 11 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   species             344 non-null    category
 1   island              344 non-null    category
 2   bill_length_mm      342 non-null    float64
 3   bill_depth_mm       342 non-null    float64
 4   flipper_length_mm   342 non-null    float64
 5   body_mass_g         342 non-null    float64
 6   sex                 333 non-null    object
 7   species_encoded     344 non-null    int64
 8   island_encoded      344 non-null    int64
 9   species_factorized  344 non-null    int64
 10  island_factorized   344 non-null    int64
dtypes: category(2), float64(4), int64(4), object(1)
memory usage: 25.2+ KB

In [63]:
df60['island'] = df60['island'].astype('category')

df60['island_cat_encoded'] = df60['island'].cat.codes
df60

,species,island,bill_length_mm,bill_depth_mm,flipper_length_mm,body_mass_g,sex,species_encoded,island_encoded,species_factorized,island_factorized,species_cat_encoded,island_cat_encoded
0,Adelie,Torgersen,39.1,18.7,181.0,3750.0,Male,0,0,0,0,0,2
1,Adelie,Torgersen,39.5,17.4,186.0,3800.0,Female,0,0,0,0,0,2
2,Adelie,Torgersen,40.3,18.0,195.0,3250.0,Female,0,0,0,0,0,2
3,Adelie,Torgersen,NaN,NaN,NaN,NaN,NaN,0,0,0,0,0,2
4,Adelie,Torgersen,36.7,19.3,193.0,3450.0,Female,0,0,0,0,0,2
...,...,...,...,...,...,...,...,...,...,...,...,...,...
339,Gentoo,Biscoe,NaN,NaN,NaN,NaN,NaN,2,1,2,1,2,0
340,Gentoo,Biscoe,46.8,14.3,215.0,4850.0,Female,2,1,2,1,2,0
341,Gentoo,Biscoe,50.4,15.7,222.0,5750.0,Male,2,1,2,1,2,0
342,Gentoo,Biscoe,45.2,14.8,212.0,5200.0,Female,2,1,2,1,2,0
343,Gentoo,Biscoe,49.9,16.1,213.0,5400.0,Male,2,1,2,1,2,0

# Label encoding using SKlearn

In [64]:
from sklearn.preprocessing import LabelEncoder

#create label instance
encoder = LabelEncoder()

In [65]:
df60['species_sklearn_encoder'] = encoder.fit_transform(df60['species'])
df60

,species,island,bill_length_mm,bill_depth_mm,flipper_length_mm,body_mass_g,sex,species_encoded,island_encoded,species_factorized,island_factorized,species_cat_encoded,island_cat_encoded,species_sklearn_encoder
0,Adelie,Torgersen,39.1,18.7,181.0,3750.0,Male,0,0,0,0,0,2,0
1,Adelie,Torgersen,39.5,17.4,186.0,3800.0,Female,0,0,0,0,0,2,0
2,Adelie,Torgersen,40.3,18.0,195.0,3250.0,Female,0,0,0,0,0,2,0
3,Adelie,Torgersen,NaN,NaN,NaN,NaN,NaN,0,0,0,0,0,2,0
4,Adelie,Torgersen,36.7,19.3,193.0,3450.0,Female,0,0,0,0,0,2,0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
339,Gentoo,Biscoe,NaN,NaN,NaN,NaN,NaN,2,1,2,1,2,0,2
340,Gentoo,Biscoe,46.8,14.3,215.0,4850.0,Female,2,1,2,1,2,0,2
341,Gentoo,Biscoe,50.4,15.7,222.0,5750.0,Male,2,1,2,1,2,0,2
342,Gentoo,Biscoe,45.2,14.8,212.0,5200.0,Female,2,1,2,1,2,0,2
343,Gentoo,Biscoe,49.9,16.1,213.0,5400.0,Male,2,1,2,1,2,0,2

# One hot encoding